In [1]:
import pandas as pd
import numpy as np

In [2]:
features = np.array([[1,1,1],
                     [2,2,0],
                     [3,3,1],
                     [4,4,0],
                     [5,5,1],
                     [6,6,0],
                     [7,7,1],
                     [8,7,0],
                     [9,7,1]]
                   )

# Convert feature matrix into DataFrame

In [3]:
dataframe = pd.DataFrame(features)

In [4]:
corr_matrix = dataframe.corr().abs()

In [5]:
upper = corr_matrix.where(np.triu(np.ones(corr_matrix.shape),k=1).astype(np.bool))

In [6]:
to_drop = [column for column in upper.columns if any(upper[column]>0.95)]

In [7]:
dataframe.drop(dataframe.columns[to_drop], axis=1).head(3)

   0  2
0  1  1
1  2  0
2  3  1

In [8]:
dataframe.corr()

          0         1         2
0  1.000000  0.976103  0.000000
1  0.976103  1.000000 -0.034503
2  0.000000 -0.034503  1.000000

In [9]:
upper

    0         1         2
0 NaN  0.976103  0.000000
1 NaN       NaN  0.034503
2 NaN       NaN       NaN